---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailRepesentationFor3dBars
source: html/d1621a1e-460e-5902-c71b-be0927332a33.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailRepesentationFor3dBars Property

"View for 3D Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailRepesentationFor3dBars { get; }
```